Tekla Open API Reference for Tekla Structures 2025
Angle Properties
The Angle type exposes the following members.
Properties
Name | Description
CurrentUnitType
 Gets or sets the Tekla Structures current angle type
CurrentUnitValue
 Gets the value of the angle in the current unit
DecimalPlaces
 Gets the number of decimal places used for angles.
Degrees
 Gets the angle value in degrees
Radians
 Gets the angle value in radians
Top
See Also
Reference
Angle Class
Tekla.Structures.Datatype Namespace